backup/Case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1;

adjustTimeStep	yes;

deltaT		1e-7;

maxDeltaT	4e-5;

maxCo		0.5;

writeControl    timeStep;

writeInterval   30;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    AirFoil_1
    {
        type            forceCoeffs;
        functionObjectLibs ( "libforces.so" );
        outputControl   timeStep;
        outputInterval  30;

        patches
        (
            patch1
        );

        pName       p;
        UName       U;
	liftDir (0 1 0);
	dragDir (1 0 0);
	magUInf     2.8;
        log         true;
        rhoName     rhoInf;
	rhoInf	    1000;
        CofR        (0 0 0);
        FxDir       (1 0 0);
        FyDir       (0 1 0);
        pitchAxis   (0 0 1);
        lRef        0.032;
        Aref        0.032*0.005;
    }
    AirFoil_2
    {
        type            forceCoeffs;
        functionObjectLibs ( "libforces.so" );
        outputControl   timeStep;
        outputInterval  30;

        patches
        (
            patch2
        );

        pName       p;
        UName       U;
	liftDir (0 1 0);
	dragDir (1 0 0);
	magUInf     2.8;
        log         true;
        rhoName     rhoInf;
	rhoInf	    1000;
        CofR        (0 0 0);
        FxDir       (1 0 0);
        FyDir       (0 1 0);
        pitchAxis   (0 0 1);
        lRef        0.032;
        Aref        0.032*0.005;
    }
    AirFoil_3
    {
        type            forceCoeffs;
        functionObjectLibs ( "libforces.so" );
        outputControl   timeStep;
        outputInterval  30;

        patches
        (
            patch3
        );

        pName       p;
        UName       U;
	liftDir (0 1 0);
	dragDir (1 0 0);
	magUInf     2.8;
        log         true;
        rhoName     rhoInf;
	rhoInf	    1000;
        CofR        (0 0 0);
        FxDir       (1 0 0);
        FyDir       (0 1 0);
        pitchAxis   (0 0 1);
        lRef        0.032;
        Aref        0.032*0.005;
    }

    AirFoil_All
    {
        type            forceCoeffs;
        functionObjectLibs ( "libforces.so" );
        outputControl   timeStep;
        outputInterval  30;

        patches
        (
            patch1
	    patch2
	    patch3
        );

        pName       p;
        UName       U;
	liftDir (0 1 0);
	dragDir (1 0 0);
	magUInf     2.8;
        log         true;
        rhoName     rhoInf;
	rhoInf	    1000;;
        CofR        (0 0 0);
        FxDir       (1 0 0);
        FyDir       (0 1 0);
        pitchAxis   (0 0 1);
        lRef        1;
        Aref        1;
    }
}

// ************************************************************************* //
