backup/Case/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    FrontAndBack
    {
        type            empty;
    }
    patch1
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    patch2
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    patch3
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    Shaft
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    Inlet
    {
        type            calculated;
        value           uniform 0;
    }
    Lat-Wall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    Outlet
    {
        type            calculated;
        value           uniform 0;
    }
    AMI-Rt
    {
        type            cyclicAMI;
        value           $internalField;
    }
    AMI-St
    {
        type            cyclicAMI;
        value           $internalField;
    }
}


// ************************************************************************* //
