backup/Case/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    FrontAndBack
    {
        type            empty;
    }
    patch1
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
31.4976
25.3237
24.442
25.7352
27.654
29.5187
31.3471
33.2001
...
)
;
    }
    patch2
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
31.5003
25.3267
24.4422
25.7377
27.6562
29.5177
31.3473
33.1989
...
)
;
    }
    patch3
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
31.499
25.3287
24.4422
25.7362
27.6598
29.5231
31.352
33.1986
...
)
;
    }
    Shaft
    {
        type            calculated;
        value           nonuniform List<scalar> 
18
(
31.1456
31.0135
30.9189
30.8621
30.843
30.8621
30.9189
31.0135
31.1456
31.1456
31.0135
30.9189
30.8621
30.843
30.8621
30.9189
31.0135
31.1456
)
;
    }
    Inlet
    {
        type            calculated;
        value           uniform 0;
    }
    Lat-Wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
98
(
273.784
309.651
240.109
237.157
644.435
1268.48
789.511
1008.87
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           uniform 0;
    }
    AMI-St
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    AMI-Rt
    {
        type            cyclicAMI;
        value           uniform 0;
    }
}


// ************************************************************************* //
